
import bpy,sys
from mathutils import*
from ctypes import*
#--------------------------------------------------------------------------
class 卐DLL类型():
    def __init__(self):
        wm = bpy.context.window_manager;
        self.dll=None;
        #if(".." not in sys.path):sys.path.append("..");
        if("B:\\" not in sys.path):sys.path.append("B:\\");

_卐DLL=卐DLL类型();_handle2d=None;_handle3d=None;
dllCLIB=None;dllTEST=None;dllIMDJS=None;dllMESH=None;
space节点LIB=None;region节点LIB=None;
#====色=======================================================
t3黑LIB=(0.0,0.0,0.0);t3白LIB=(1.0,1.0,1.0);t3灰LIB=(0.5,0.5,0.5);
t3浅黑LIB=(0.2,0.2,0.2);t3灰蓝LIB=(0.6,0.6,0.7);t3灰青LIB=(0.7,0.7,0.9);

#--------------------------------------------------------------------------
t3红LIB=(1.0,0.0,0.0);t3绿LIB=(0.0,1.0,0.0);t3青LIB=(0.0,1.0,1.0);t3蓝LIB=(0.0,0.0,1.0);

t3紫LIB=(1.0,0.0,1.0);t3粉紫LIB=(1.0,0.5,1.0);t3橙LIB=(1.0,0.7,0.0);

t3深红LIB=(0.5,0.0,0.0);t3深绿LIB=(0.0,0.5,0.0);t3深蓝LIB=(0.0,0.0,0.5);

t4青LIB=(0.0, 1.0, 1.0,1.0);t4黄LIB=(1.0, 1.0, 0.0,1.0);t4深绿LIB=(0.5, 0.7, 0.0,1.0);
#----画线---------------------------------------------------------------
b显示3dLIB=[False];#只有列表传值比较保险
Li显示2dLIB=[0];Li显示3dLIB=[0];
Lv位X轴LIB=[];Lv位顶LIB=[];LvX位LIB=[];


LvX位绿LIB=[];Lv位叉积LIB=[];Lv物转位绿顶LIB=[];
#----法线------------------------------------------------------------------
Lv法线位画LIB=[];Lv法线顶位画LIB=[];
#----矩阵-------------------------------------------------------------------
Lt3红绿蓝LIB=[t3红LIB,t3绿LIB,t3蓝LIB,t3青LIB];
L物序L4v位矩阵画LIB=[];Lv位矩阵yLIB=[];Lv位矩阵zLIB=[];
Lv位Q矩阵xLIB=[];Lv位Q矩阵yLIB=[];Lv位Q矩阵zLIB=[];

#----物位----------------------------------------------------------------
Lv位实物画LIB=[];Lv位实物顶LIB=[];Lv位实物XLIB=[];
Lcf3位画LIB=[];Lcf3位蓝画LIB=[];
#----线段----------------------------------------------------------------
L条序Lv线段序画LIB=[];LL2cf3线段序画LIB=[];L条序LΩωv线段画LIB=[];
#☐☐☐☐☐┄☐☐☐☐☐☐
#☐☐☐┄─┃\☐☐☐☐☐☐
#☐┄─☐☐┃☐\☐☐☐☐☐
#----字------------------------------------------------------------------
Lv三角面位画LIB=[];

#----画2d-----------------------------------------------------------------
Dn开始f2画LIB={};
b显示2dLIB=[False];

#----兼容----------------------------------------------------------------
Lv物位蓝LIB=[];
#-------------------------------------------------------------------
b停止更新G=False;

#----CTYPES--------------------------------------------------------
ci2LIB=(c_int*2)(-1,-1);ci3LIB=(c_int*3)(-1,-1,-1);ci4LIB=(c_int*4)(-1,-1,-1,-1);
cf2LIB=(c_float*2)(-1.0,-1.0);cf3LIB=(c_float*3)(-1.0,-1.0,-1.0);cf4LIB=(c_float*4)(-1.0,-1.0,-1.0,-1.0);
cf33LIB=(c_float*3*3)(*[cf3LIB]*3);cf44LIB=(c_float*4*4)(*[cf4LIB]*4);


















